{
    "titulo": "¡BIENVENIDO!",
    "introduccion": "Estamos encantados de que hayas decidido unirte a este emocionante viaje hacia el mundo de la teoría de la computación. Este OVA ha sido diseñado para proporcionarte una experiencia de aprendizaje interactiva y autodidacta, donde podrás adquirir los conocimientos fundamentales necesarios para comprender los conceptos clave de esta disciplina. ¡Estamos emocionados de acompañarte en esta travesía del mundo de la teoría de la computación!",
    "presentacion": "El Objeto Virtual de Aprendizaje 'Introducción a la Teoría de la Computación: Explorando los Fundamentos' es un recurso interactivo diseñado para brindar a los estudiantes una sólida comprensión de los fundamentos de la teoría de la computación. A través de una combinación de contenido teórico, ejemplos prácticos y actividades interactivas, este objeto virtual ofrece una experiencia de aprendizaje envolvente y autodidacta.  Brinda a los estudiantes una información complementaria de lo visto en clase, preparándolos para cursos más avanzados en ciencias de la computación y ayudándoles a comprender los conceptos subyacentes que sustentan el campo de la informatica.A lo largo de este curso, te sumergirás en un fascinante universo de autómatas, gramáticas formales y máquinas de Turing. Explorarás cómo estos conceptos se entrelazan y brindan las bases para comprender la computabilidad y los límites de lo que puede ser calculado por una máquina.",
    "temas": "Conceptos básicos de la teoría de la computación: El objeto virtual comienza introduciendo los conceptos fundamentales de la teoría de la computación, como autómatas finitos, gramáticas formales, máquinas de Turing y lenguajes formales. Los estudiantes adquierenuna comprensión sólida de estos conceptos a través de explicaciones claras y ejemplos ilustrativos. Lenguajes formales y gramáticas:Se explora en detalle el estudio de los lenguajes formales y las gramáticas utilizadas para describirlos. Los estudiantes aprenderánsobre diferentes tipos de gramáticas, como gramáticas regulares, libres de contexto y sensibles al contexto, y su relación con la generación de lenguajes formales. Autómatas y reconocimiento de lenguajes: Se centra en la teoría de autómatas, incluyendoautómatas finitos deterministas y no deterministas, autómatas de pila y máquinas de Turing. Los estudiantes explorarán cómo estos modelos teóricos pueden utilizarse para reconocer y procesar lenguajes formales."
}